R-intro/R-intro-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-01 水 20:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>初心者用 R 言語講座演習ノート</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">初心者用 R 言語講座演習ノート</h1>
<p>
<a href="http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf">初心者用 - R_Stats2.pdf</a>
</p>

<div id="outline-container-orgc012bdf" class="outline-2">
<h2 id="orgc012bdf">8. ファイルからの読み込み</h2>
<div class="outline-text-2" id="text-orgc012bdf">
</div>
<div id="outline-container-org893d050" class="outline-3">
<h3 id="org893d050">データファイルとフォルダ</h3>
<div class="outline-text-3" id="text-org893d050">
<p>
まず、以下のような数値データが書かれたファイルを用意しましょう。
</p>

<ul class="org-ul">
<li>仮にこのファイル 名を testdata.txt、</li>
<li>ディレクトリの位置を /Users/saito/R/data とします。</li>
</ul>

<div class="org-src-container">
<pre class="src src-R"> 14
 14
 21
 35
 6
</pre>
</div>

<p>
まず setwd によって作業ディレクトリを/Users/saito/TMP にします。
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #e5786d;">setwd</span>(<span style="color: #95e454;">"/Users/saito/TMP"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa97dca" class="outline-3">
<h3 id="orgfa97dca">数値列を読み込む scan 関数</h3>
<div class="outline-text-3" id="text-orgfa97dca">
<p>
次に scan コマンドを使って、データを変数 x に読み込みます。
</p>
<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> scan(<span style="color: #95e454;">"R-intro/data/08-01.txt"</span>))

</pre>
</div>

<pre class="example">
Read 5 items
[1] 14 14 21 35  6
</pre>


<p>
x にファイルの数値が <b>ベクトル</b> として読み込まれています。
</p>
</div>
</div>

<div id="outline-container-org1608cda" class="outline-3">
<h3 id="org1608cda">表の読み込みを行う関数 read.table</h3>
<div class="outline-text-3" id="text-org1608cda">
<p>
以下のようなタブ区切 りのファイル batters.txt があったとします。
</p>

<div class="org-src-container">
<pre class="src src-R">
        Team    At_Bat  Hits    Home_Runs
Nomura  Hawks   10472   2901    657
Harimoto        Flyers  9666    3085    504
Kinugasa        Carps   9404    2543    504
Oh      Giants  9250    2786    868
Kadota  Hawks   8868    2566    567

</pre>
</div>

<p>
read.table により データ・フレームとして読み込む:
</p>

<div class="org-src-container">
<pre class="src src-R">
(batters <span style="color: #e5786d;">&lt;-</span> read.table(<span style="color: #95e454;">"R-intro/data/batters.txt"</span>, header=T, sep=<span style="color: #95e454;">"\t"</span>, row.names=1))

</pre>
</div>

<pre class="example">
           Team At_Bat Hits Home_Runs
Nomura    Hawks  10472 2901       657
Harimoto Flyers   9666 3085       504
Kinugasa  Carps   9404 2543       504
Oh       Giants   9250 2786       868
Kadota    Hawks   8868 2566       567
</pre>


<p>
x$Hits などで安打数を得ることができます。
</p>

<div class="org-src-container">
<pre class="src src-R">
x$Team
x$Hits

</pre>
</div>

<pre class="example">
[1] 3085
[1] Hawks  Flyers Carps  Giants Hawks 
Levels: Carps Flyers Giants Hawks
[1] 2901 3085 2543 2786 2566
</pre>


<p>
read.table の引数の意味 :
</p>

<dl class="org-dl">
<dt>"batters.txt"</dt><dd>ファイル名</dd>
<dt>header = T</dt><dd>Team, At_Bat など のヘッダーがあることを示す</dd>
<dt>sep = "\t"</dt><dd>タブ区切りであることを示し</dd>
<dt>row.names = 1 </dt><dd>行の名前が1列分あることを指定</dd>
</dl>

<p>
read.table の引数のオプション
</p>

<dl class="org-dl">
<dt>quote=""</dt><dd>引用符""の処理をしない。</dd>
<dt>check.names=F</dt><dd>列ラベル名の自動変換が抑制される。</dd>
<dt>omment.char=""</dt><dd>コメント記号("#")を無効にできる。</dd>
</dl>

<p>
課題 8: 課題 7-1 の表をタブ区切りファイルとして保存し、データフレー
ムとして読み込んでみましょう。
</p>
</div>
</div>
</div>

<div id="outline-container-orgdc15ec7" class="outline-2">
<h2 id="orgdc15ec7">9. ファイルへの書き出し (データの保存)</h2>
<div class="outline-text-2" id="text-orgdc15ec7">
<p>
ファイル出力を行なう関数
</p>
</div>

<div id="outline-container-orgf5fcdfb" class="outline-3">
<h3 id="orgf5fcdfb">write関数</h3>
<div class="outline-text-3" id="text-orgf5fcdfb">
<ul class="org-ul">
<li>一番簡単なのが write 関数でしょう。</li>
<li>変数に格納された数値をファイルに書き出すことができます。</li>
</ul>

<div class="org-src-container">
<pre class="src src-R">
x <span style="color: #e5786d;">&lt;-</span> c(10, 12, 15, 19, 21, 34)
write(x, <span style="color: #95e454;">"R-intro/data/outfile1.txt"</span>, ncolumns = 1)

</pre>
</div>

<ul class="org-ul">
<li>x の内容が R-intro/data/outfile1.txtというファイルに書き込まれます。</li>
<li>ncolumns = 1 は数 値を1 列で出力することを指定しています。</li>
</ul>

<p>
行列データもファイルに書き出すことが可能で す。
</p>

<div class="org-src-container">
<pre class="src src-R">
x <span style="color: #e5786d;">&lt;-</span> matrix(c(1,2,3,4,5,6), nrow=2, ncol=3, byrow=T)
write(t(x), <span style="color: #95e454;">"R-intro/data/outfile2.txt"</span>, ncolumns=ncol(x), sep=<span style="color: #95e454;">"\t"</span>) 

</pre>
</div>

<dl class="org-dl">
<dt>t(x) </dt><dd>行列 x を転置しないと、出力されるファイル中の行列が転置
されたものになってしまうので、注意が必要です。</dd>
<dt>ncolumns=ncol(x)</dt><dd>で出力される列数を行列 x の列数に揃え、</dd>
<dt>sep = “\t”</dt><dd>でタブ区切りファイルにすることを指定しています。</dd>
</dl>
</div>
</div>

<div id="outline-container-org1af4e57" class="outline-3">
<h3 id="org1af4e57">write.table関数</h3>
<div class="outline-text-3" id="text-org1af4e57">
<p>
データフレームをファイルに出力する関数
</p>
<div class="org-src-container">
<pre class="src src-R">
batters[,c(3,4)]
write.table(batters[,c(3,4)], <span style="color: #95e454;">"R-intro/data/outfile3.txt"</span>, sep=<span style="color: #95e454;">"=\t"</span>, row.names=T, col.names=<span style="color: #92a65e; font-weight: bold;">NA</span>)

</pre>
</div>

<pre class="example">
         Hits Home_Runs
Nomura   2901       657
Harimoto 3085       504
Kinugasa 2543       504
Oh       2786       868
Kadota   2566       567
</pre>


<dl class="org-dl">
<dt>row.names=T</dt><dd>行名(先頭に空白を挿入)を入れます。</dd>
<dt>col.names=NA</dt><dd>でそれぞれ行名、列名(先頭に空白を挿入)を入れます。</dd>
<dt>quote=F</dt><dd>指定すると、二重引用符を除いた出力になります。</dd>
</dl>

<p>
  課題 9: 上記データフレームで、各バッターに対して打率、すなわち Hits / At_Bat を計算
し、その結果を”outfile4.txt”に格納しましょう。
</p>
</div>
</div>
</div>

<div id="outline-container-org0af74d5" class="outline-2">
<h2 id="org0af74d5">10. プログラムの読み込み</h2>
<div class="outline-text-2" id="text-org0af74d5">
<p>
一連の手続きをファイルにしておいて、それを必要なときに実行すること
が可能です。
</p>

<p>
例えば、以下のような操作を記述したファイ ルを用意します。
ファイル名を R-intro/code/substtest.R とします。
</p>

<div class="org-src-container">
<pre class="src src-R">
x <span style="color: #e5786d;">&lt;-</span> c(1,2,3,4,5)
y <span style="color: #e5786d;">&lt;-</span> c(2,4,6,8,10)
z <span style="color: #e5786d;">&lt;-</span> x + y

</pre>
</div>

<p>
これを以下のように source(“substtest.R”)とすると、substtest.R 中に
記述された手続きを 実行することができます。結果として x, y, z それぞ
れに値が代入されます。
</p>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #e5786d;">source</span>(<span style="color: #95e454;">"R-intro/code/substtest.R"</span>)
c(x,y,z)
</pre>
</div>

<pre class="example">
[1]  1  2  3  4  5  2  4  6  8 10  3  6  9 12 15
</pre>


<p>
課題 10: 課題 8 の手続きを dframetest.R というファイルに書き込み、
source を使ってその 手続きを実行してみましょう。14
</p>
</div>
</div>


<div id="outline-container-orgf7648c2" class="outline-2">
<h2 id="orgf7648c2">11. 関数の定義</h2>
<div class="outline-text-2" id="text-orgf7648c2">
<p>
関数は数学的にはある入力に対応した出力を返すものです。
</p>

<p>
コンピュータプログラミングでは、まとまった処理の単位を表します8。
</p>

<p>
例えば今、二つの数を足して 2 で割る関数 plus を考えます。
</p>

<p>
これは数学では plus(x, y) = (x + y) / 2 などと記述できます。
</p>
</div>

<div id="outline-container-org3fff41f" class="outline-3">
<h3 id="org3fff41f">function(引数リスト) { 関数本体 }</h3>
<div class="outline-text-3" id="text-org3fff41f">
<p>
R では以下のよう に function を使って以下のように記述します。
</p>

<div class="org-src-container">
<pre class="src src-R">
<span style="color: #cae682;">plus</span> <span style="color: #e5786d;">&lt;-</span> <span style="color: #8ac6f2; font-weight: bold;">function</span>(x, y) {
  <span style="color: #8ac6f2; font-weight: bold;">return</span> ((x + y) / 2)
}
plus
plus(10,20)
</pre>
</div>

<pre class="example">
function(x, y) {
  return ((x + y) / 2)
}
[1] 15
</pre>


<ul class="org-ul">
<li>これによって x と y を入力(引数)とする関数 plus が定義されます。
出力(返り値)が(x + y) / 2 となる。</li>
<li>その後、  plus(10, 20) とすれば、
<ul class="org-ul">
<li>x に 10、y に 20 が代入され、</li>
<li>関数plusが実行され，</li>
<li>return は最終的な返り値を決め,</li>
<li>計算結果の 15 という答えが返ってくる。
関数のより一般的な定義の仕方は、</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orga8909dd" class="outline-3">
<h3 id="orga8909dd">関数の一般的な定義の</h3>
<div class="outline-text-3" id="text-orga8909dd">
<div class="org-src-container">
<pre class="src src-R">

  <span style="color: #cae682;">&#38306;&#25968;&#21517;</span> <span style="color: #e5786d;">&lt;-</span> <span style="color: #8ac6f2; font-weight: bold;">function</span> (&#24341;&#25968; 1, &#24341;&#25968; 2, &#183;&#183;&#183;, ...) {
    &#24341;&#25968;&#12434;&#20351;&#12387;&#12383;&#27096;&#12293;&#12394;&#20966;&#29702;
    <span style="color: #8ac6f2; font-weight: bold;">return</span>(&#36820;&#12426;&#20516;)
  } 
</pre>
</div>
</div>

<div id="outline-container-orgdbf1bb6" class="outline-4">
<h4 id="orgdbf1bb6">課題 11:</h4>
<div class="outline-text-4" id="text-orgdbf1bb6">
<p>
f(x, a, b, c) = ax2 + bx + c を R の関数として実装しましょう。
f(4, 3, 2, 1)はいくつ になりますか。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2021-12-01 水 20:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
